In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings
warnings.filterwarnings('ignore')

sns.set()

# Graphics in SVG format are more sharp and legible
#%config InlineBackend.figure_format = 'svg'

https://blog.csdn.net/youngbit007/article/details/54288603

### groupby

In [2]:

df = pd.DataFrame({'key1':list('aabba'),
                  'key2': ['one','two','one','two','one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.153547  0.869463
1    a  two -0.661793  0.576489
2    b  one -0.060469 -0.704666
3    b  two  0.643067  0.493080
4    a  one  0.775080 -1.936886

In [3]:
grouped=df['data1'].groupby(df['key1'])
grouped.mean()

key1
a    0.422278
b    0.291299
Name: data1, dtype: float64

In [4]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
years=np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

California  2005   -0.661793
            2006   -0.060469
Ohio        2005    0.898307
            2006    0.775080
Name: data1, dtype: float64

In [5]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.422278 -0.163645
b     0.291299 -0.105793

In [6]:
for name, group in df.groupby('key1'):
    print (name)
    print (group)

a
  key1 key2     data1     data2
0    a  one  1.153547  0.869463
1    a  two -0.661793  0.576489
4    a  one  0.775080 -1.936886
b
  key1 key2     data1     data2
2    b  one -0.060469 -0.704666
3    b  two  0.643067  0.493080

In [7]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print ('===k1,k2:')
    print (k1,k2)
    print ('===k3:')
    print (group)

===k1,k2:
a one
===k3:
  key1 key2     data1     data2
0    a  one  1.153547  0.869463
4    a  one  0.775080 -1.936886
===k1,k2:
a two
===k3:
  key1 key2     data1     data2
1    a  two -0.661793  0.576489
===k1,k2:
b one
===k3:
  key1 key2     data1     data2
2    b  one -0.060469 -0.704666
===k1,k2:
b two
===k3:
  key1 key2     data1    data2
3    b  two  0.643067  0.49308

In [8]:
piece=dict(list(df.groupby('key1')))
piece['a']

  key1 key2     data1     data2
0    a  one  1.153547  0.869463
1    a  two -0.661793  0.576489
4    a  one  0.775080 -1.936886

In [9]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.533712
     two   0.576489
b    one  -0.704666
     two   0.493080

In [10]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=list('abcde'),
                   index=['Joe','Steve','Wes','Jim','Travis'])

people.ix[2:3,['b','c']]=np.nan #设置几个nan
people

               a         b         c         d         e
Joe    -0.616012 -0.910703 -0.927605  0.217101  1.199413
Steve  -1.446073 -1.559583 -0.940366 -0.384141 -0.080095
Wes    -0.942696       NaN       NaN  0.311844 -0.814037
Jim     0.644853 -1.591756  1.169255  1.569039  0.248825
Travis  1.375679  0.901024 -0.142123 -1.874202 -1.432882

In [11]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}
by_column=people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe    -0.710504 -0.327302
Steve  -1.324507 -3.085751
Wes     0.311844 -1.756733
Jim     2.738294 -0.698078
Travis -2.016324  0.843821

In [12]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.913855 -2.502459  0.241650  2.097984  0.634201
5 -1.446073 -1.559583 -0.940366 -0.384141 -0.080095
6  1.375679  0.901024 -0.142123 -1.874202 -1.432882

In [13]:
key_list=['one','one','one','two','two'] 
people.groupby([len, key_list]).sum()

              a         b         c         d         e
3 one -1.558708 -0.910703 -0.927605  0.528945  0.385375
  two  0.644853 -1.591756  1.169255  1.569039  0.248825
5 one -1.446073 -1.559583 -0.940366 -0.384141 -0.080095
6 two  1.375679  0.901024 -0.142123 -1.874202 -1.432882

In [14]:
def peak_to_peak(arr):
    print(arr)
    return arr.max()

people.groupby(len).agg(peak_to_peak)

Joe   -0.616012
Wes   -0.942696
Jim    0.644853
Name: a, dtype: float64
Steve   -1.446073
Name: a, dtype: float64
Travis    1.375679
Name: a, dtype: float64
Joe   -0.910703
Wes         NaN
Jim   -1.591756
Name: b, dtype: float64
Steve   -1.559583
Name: b, dtype: float64
Travis    0.901024
Name: b, dtype: float64
Joe   -0.927605
Wes         NaN
Jim    1.169255
Name: c, dtype: float64
Steve   -0.940366
Name: c, dtype: float64
Travis   -0.142123
Name: c, dtype: float64
Joe    0.217101
Wes    0.311844
Jim    1.569039
Name: d, dtype: float64
Steve   -0.384141
Name: d, dtype: float64
Travis   -1.874202
Name: d, dtype: float64
Joe    1.199413
Wes   -0.814037
Jim    0.248825
Name: e, dtype: float64
Steve   -0.080095
Name: e, dtype: float64
Travis   -1.432882
Name: e, dtype: float64

          a         b         c         d         e
3  0.644853 -0.910703  1.169255  1.569039  1.199413
5 -1.446073 -1.559583 -0.940366 -0.384141 -0.080095
6  1.375679  0.901024 -0.142123 -1.874202 -1.432882

### 根据索引级别进行分组
层次化索引最方便的地方就在于他能够根据索引级别进行聚合。要实现该目的，通过level关键字出入级别编号或者名称即可:

In [15]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])#二级列索引，并为每级索引命名
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.527858  0.302222 -1.306825 -0.827712  0.214093
1     -0.631287 -0.334231 -0.515884  0.254175  0.893344
2     -0.128542 -0.438166 -1.495704 -0.634805 -1.354737
3     -0.092613  0.163760 -0.449830 -0.635628  0.101923

In [16]:
hier_df.groupby(level=['cty'],axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

### 分组级运算和转换

#### 聚合只是分组运算的一种，它是数据转换的特列。transform 和apply更牛叉.

transform会将一个函数应用到各个分组，然后将结果放在适当的位置. 如果各分组产生的标量值，则该标量值会被广播出去。

transform也是有严格条件的特殊函数：传入的函数只能产生两种结果，要么产生一个可以广播的标量值(如：np.mean), 要么产生一个相同大小的结果数组。

In [17]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=list('abcde'),
                   index=['Joe','Steve','Wes','Jim','Travis'])
people

               a         b         c         d         e
Joe     0.645441 -0.538066 -1.703705  0.055799 -0.200523
Steve   1.318538  0.872041  2.474418  1.478979 -0.989337
Wes    -0.459424 -1.559077 -1.190626 -0.558452 -2.217094
Jim     0.326959 -0.360913 -0.289009 -2.047707  1.293272
Travis -0.880399  0.873707 -0.906055  0.390788 -1.238295

In [18]:
key=['one','two','one','two','one']
people.groupby(key).mean()

            a         b         c         d         e
one -0.231460 -0.407812 -1.266795 -0.037288 -1.218637
two  0.822749  0.255564  1.092705 -0.284364  0.151968

In [19]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.231460 -0.407812 -1.266795 -0.037288 -1.218637
Steve   0.822749  0.255564  1.092705 -0.284364  0.151968
Wes    -0.231460 -0.407812 -1.266795 -0.037288 -1.218637
Jim     0.822749  0.255564  1.092705 -0.284364  0.151968
Travis -0.231460 -0.407812 -1.266795 -0.037288 -1.218637

In [20]:
def demean(arr):
    return arr-arr.mean()

demeaned=people.groupby(key).transform(demean)
demeaned

               a         b         c         d         e
Joe     0.876901 -0.130254 -0.436909  0.093087  1.018114
Steve   0.495790  0.616477  1.381713  1.763343 -1.141304
Wes    -0.227963 -1.151265  0.076169 -0.521163 -0.998456
Jim    -0.495790 -0.616477 -1.381713 -1.763343  1.141304
Travis -0.648938  1.281519  0.360740  0.428076 -0.019658

In [21]:
demeaned.groupby(key).mean()

                a    b    c             d             e
one  0.000000e+00  0.0  0.0 -1.850372e-17 -7.401487e-17
two  2.775558e-17  0.0  0.0  0.000000e+00  0.000000e+00

### 最一般化的groupby 方法是apply.

In [22]:
df1=pd.DataFrame({'sex':list('FFMFMMF'),'smoker':list('YNYYNYY'),'age':[21,30,17,37,40,18,26],'weight':[120,100,132,140,94,89,123]})
df1

  sex smoker  age  weight
0   F      Y   21     120
1   F      N   30     100
2   M      Y   17     132
3   F      Y   37     140
4   M      N   40      94
5   M      Y   18      89
6   F      Y   26     123

#### 新生成一列

In [23]:
df1['age'].apply(lambda x : 1 if x >18 else 0)

0    1
1    1
2    0
3    1
4    1
5    0
6    1
Name: age, dtype: int64

#### 根据分组选出最高的5个payout值

In [24]:
def top(df,col,n=5):
    return df.sort_values(by=col)[-n:]

#### 对smoker分组并应用该函数

In [25]:
df1.groupby('smoker').apply(top,col='weight',n=2)

         sex smoker  age  weight
smoker
N      4   M      N   40      94
       1   F      N   30     100
Y      2   M      Y   17     132
       3   F      Y   37     140

#### 多参数版本

In [27]:
df1.groupby(['smoker','sex']).apply(top,n=3,col='weight')

             sex smoker  age  weight
smoker sex
N      F   1   F      N   30     100
       M   4   M      N   40      94
Y      F   0   F      Y   21     120
           6   F      Y   26     123
           3   F      Y   37     140
       M   5   M      Y   18      89
           2   M      Y   17     132

### 分位数和桶分析

#### cut and qcut与groupby结合起来，能轻松的对数据集的桶(bucket)或者分位数(quantile)分析

In [ ]:
frame=pd.DataFrame({'data1':np.random.randn(1000),
                   'data2': np.random.randn(1000)})
frame

In [ ]:
factor=pd.cut(frame.data1, 4)
factor[:10]

In [ ]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}
grouped=frame.data2.groupby(factor)
grouped.apply(get_stats).unstack()

#### 这些都是长度相等的桶，要根据样本分为数得到大小相等的桶，使用qcut即可.

长度相等的桶：区间大小相等 
大小相等的桶：数据点数量相等

In [ ]:
grouping=pd.qcut(frame.data1,10,labels=False)#label=false即可值获取分位数的编号
grouped=frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

### meshgrid

In [ ]:
x = np.arange(-5, 5, 0.1)
y = np.arange(-5, 5, 0.1)
xx, yy = np.meshgrid(x, y, sparse=True)
z = np.sin(xx**2 + yy**2) / (xx**2 + yy**2)
h = plt.contourf(x,y,z)

In [ ]:
nx,ny = (3, 2)
x = np.linspace(0,1,nx)
y = np.linspace(0,1,ny)
print(x, y)

xv, yv = np.meshgrid(x, y, sparse=False, indexing='ij')
xv
yv

In [ ]:
for i in range(nx):
    for j in range(ny):
        print(xv[i,j], yv[i,j])

In [ ]:
from sklearn import tree
X = [[0, 0], [1, 1]]
Y = [0, 1]
clf = tree.DecisionTreeClassifier()
clf = clf.fit(X, Y)

In [ ]:
clf.predict([[2., 2.]])

In [ ]:
clf.predict_proba([[2., 2.]])

In [ ]:
from sklearn.datasets import load_iris
from sklearn import tree
iris = load_iris()
clf = tree.DecisionTreeClassifier()
clf = clf.fit(iris.data, iris.target)

func:`export_graphviz` 出导出还支持各种美化，包括通过他们的类着色节点（或回归值），如果需要，使用显式变量和类名。Jupyter notebook也可以自动找出相同的模块

In [ ]:
import graphviz
#dot_data = tree.export_graphviz(clf, out_file='1.data')
#graph = graphviz.Source(dot_data)

dot_data = tree.export_graphviz(clf, out_file=None,
                            feature_names=iris.feature_names, 
                            class_names=iris.target_names, 
                            filled=True, rounded=True, 
                            special_characters=True) 
graph = graphviz.Source(dot_data) 
graph.render("iris")
graph

In [ ]:
clf.predict(iris.data[:1, :])

In [ ]:
clf.predict_proba(iris.data[:1, :])